order-service/k6/outputs/load-test-output.log
time="2026-01-11T21:04:31+09:00" level=info msg="✅ Loaded 100 queue tokens" source=console

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /mnt/c/Users/cch15/IdeaProjects/sparta/project/fork/rush-deal/order-service/k6/tests/load-test-order.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m30s max duration (incl. graceful stop):
              * order_rush: 1 iterations for each of 100 VUs (maxDuration: 2m0s, gracefulStop: 30s)

time="2026-01-11T21:04:31+09:00" level=info msg="🚀 RushDeal Order Load Test" source=console
time="2026-01-11T21:04:31+09:00" level=info msg="============================" source=console
time="2026-01-11T21:04:31+09:00" level=info msg="Target Users: 100" source=console
time="2026-01-11T21:04:31+09:00" level=info msg="Loaded Tokens: 100" source=console
time="2026-01-11T21:04:31+09:00" level=info msg="Product: 857daa45-d8a7-4e13-938e-5ea80dab2238" source=console
time="2026-01-11T21:04:31+09:00" level=info msg="TimeDeal: a82bc130-66d3-4306-9c92-b6864b7436a5" source=console
time="2026-01-11T21:04:31+09:00" level=info msg="Total Stock: 400 units (4 options × 100)" source=console
time="2026-01-11T21:04:31+09:00" level=info msg="Price: 95200원" source=console
time="2026-01-11T21:04:31+09:00" level=info msg="Point Discount: 1000원" source=console
time="2026-01-11T21:04:31+09:00" level=info msg="Purchase Limit: 5개/인" source=console
time="2026-01-11T21:04:31+09:00" level=info source=console
time="2026-01-11T21:04:31+09:00" level=info msg="✅ Order Service is healthy" source=console
time="2026-01-11T21:04:31+09:00" level=info source=console
time="2026-01-11T21:04:31+09:00" level=info msg="✅ Ready: 100 users will place orders simultaneously" source=console
time="2026-01-11T21:04:31+09:00" level=info msg="   - 약 70%는 정상 주문 (1~5개)" source=console
time="2026-01-11T21:04:31+09:00" level=info msg="   - 약 30%는 제한 초과 테스트 (6~9개)" source=console
time="2026-01-11T21:04:31+09:00" level=info source=console

running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
order_rush   [   0% ] 100 VUs  0m01.0s/2m0s  000/100 iters, 1 per VU
time="2026-01-11T21:04:32+09:00" level=error msg="🎯 [User 62] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:32+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:32+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:32+09:00" level=error msg="    Attempted: [Stock1×2, Stock3×4], Total: 6 > Limit: 5" source=console
time="2026-01-11T21:04:32+09:00" level=error msg="🎯 [User 46] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:32+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:32+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:32+09:00" level=error msg="    Attempted: [Stock4×4, Stock2×4], Total: 8 > Limit: 5" source=console
time="2026-01-11T21:04:32+09:00" level=info msg="✅ [User 71] Order created - Saga: 91eda79a..., Items: [Stock2×2], Total: 2, Duration: 1694ms" source=console
time="2026-01-11T21:04:32+09:00" level=info msg="✅ [User 61] Order created - Saga: 6debf133..., Items: [Stock4×2, Stock2×2, Stock3×1], Total: 5, Duration: 1685ms" source=console
time="2026-01-11T21:04:32+09:00" level=info msg="✅ [User 100] Order created - Saga: 96c5be98..., Items: [Stock1×2, Stock4×2], Total: 4, Duration: 1694ms" source=console
time="2026-01-11T21:04:32+09:00" level=info msg="✅ [User 42] Order created - Saga: 5336caa8..., Items: [Stock3×2, Stock4×1, Stock1×2], Total: 5, Duration: 1695ms" source=console
time="2026-01-11T21:04:32+09:00" level=info msg="✅ [User 65] Order created - Saga: 96bf01e7..., Items: [Stock4×2, Stock3×1, Stock2×1], Total: 4, Duration: 1692ms" source=console
time="2026-01-11T21:04:32+09:00" level=info msg="✅ [User 57] Order created - Saga: 1dedced3..., Items: [Stock2×2], Total: 2, Duration: 1691ms" source=console
time="2026-01-11T21:04:32+09:00" level=info msg="✅ [User 3] Order created - Saga: f557437a..., Items: [Stock4×2, Stock2×2, Stock1×1], Total: 5, Duration: 1695ms" source=console
time="2026-01-11T21:04:32+09:00" level=info msg="✅ [User 40] Order created - Saga: 3723eeb5..., Items: [Stock4×1], Total: 1, Duration: 1695ms" source=console
time="2026-01-11T21:04:32+09:00" level=info msg="✅ [User 15] Order created - Saga: 739e3e85..., Items: [Stock2×1, Stock1×2, Stock3×2], Total: 5, Duration: 1691ms" source=console
time="2026-01-11T21:04:32+09:00" level=info msg="✅ [User 9] Order created - Saga: 22fddbd3..., Items: [Stock3×2, Stock1×1, Stock4×2], Total: 5, Duration: 1694ms" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 22] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 33] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 49] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 93] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock4×4, Stock3×4, Stock2×2], Total: 10 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock4×4, Stock3×4], Total: 8 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock3×4, Stock1×4, Stock4×4, Stock2×2], Total: 14 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock2×3, Stock1×4, Stock4×4], Total: 11 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 95] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock2×4, Stock1×3, Stock3×4, Stock4×4], Total: 15 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 74] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 78] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock2×3, Stock4×2, Stock3×3], Total: 8 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock3×3, Stock1×4, Stock2×2], Total: 9 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 94] Order created - Saga: 27228d13..., Items: [Stock4×2, Stock2×2], Total: 4, Duration: 1781ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 75] Order created - Saga: 7588262f..., Items: [Stock3×2, Stock4×3], Total: 5, Duration: 1782ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 32] Order created - Saga: 4f4ca3bd..., Items: [Stock3×2], Total: 2, Duration: 1777ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 12] Order created - Saga: b616cd4f..., Items: [Stock3×1, Stock4×2], Total: 3, Duration: 1779ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 31] Order created - Saga: 12cb9d84..., Items: [Stock1×1], Total: 1, Duration: 1781ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 34] Order created - Saga: 3d9c3241..., Items: [Stock1×2], Total: 2, Duration: 1782ms" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 27] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock2×3, Stock4×4, Stock3×2, Stock1×4], Total: 13 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 90] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock1×3, Stock2×2, Stock3×4, Stock4×2], Total: 11 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 55] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock3×4, Stock4×2, Stock1×3], Total: 9 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 99] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock2×4, Stock1×2], Total: 6 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 25] Order created - Saga: 6f20521b..., Items: [Stock1×1, Stock2×1], Total: 2, Duration: 1891ms" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 7] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock1×4, Stock4×4], Total: 8 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 59] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console

running (0m02.0s), 069/100 VUs, 31 complete and 0 interrupted iterations
order_rush   [  31% ] 100 VUs  0m02.0s/2m0s  031/100 iters, 1 per VU
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock1×4, Stock2×2], Total: 6 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 79] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock2×4, Stock3×2, Stock1×3, Stock4×4], Total: 13 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 63] Order created - Saga: 19f43b18..., Items: [Stock1×2, Stock2×1], Total: 3, Duration: 1987ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 45] Order created - Saga: 7161ce36..., Items: [Stock1×2, Stock3×1], Total: 3, Duration: 1986ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 50] Order created - Saga: ab9381ac..., Items: [Stock2×2], Total: 2, Duration: 1992ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 97] Order created - Saga: d7a41474..., Items: [Stock3×2, Stock1×1], Total: 3, Duration: 1995ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 44] Order created - Saga: a9ff7733..., Items: [Stock2×1], Total: 1, Duration: 1995ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 66] Order created - Saga: 230eaf21..., Items: [Stock4×1, Stock1×1], Total: 2, Duration: 2026ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 81] Order created - Saga: f32ec546..., Items: [Stock4×2, Stock3×2], Total: 4, Duration: 2025ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 21] Order created - Saga: 161bad0b..., Items: [Stock4×1], Total: 1, Duration: 2037ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 30] Order created - Saga: dee4bbd6..., Items: [Stock3×1], Total: 1, Duration: 2142ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 76] Order created - Saga: 20c832b4..., Items: [Stock2×2], Total: 2, Duration: 2144ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 35] Order created - Saga: f4045553..., Items: [Stock3×1], Total: 1, Duration: 2146ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 82] Order created - Saga: 9e9bc5d6..., Items: [Stock3×1], Total: 1, Duration: 2141ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 56] Order created - Saga: 6f4e9f84..., Items: [Stock1×1], Total: 1, Duration: 2145ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 19] Order created - Saga: cdaf89ea..., Items: [Stock1×2], Total: 2, Duration: 2148ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 98] Order created - Saga: 71ce1aed..., Items: [Stock2×2], Total: 2, Duration: 2150ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 43] Order created - Saga: 7038de6a..., Items: [Stock2×2, Stock4×2], Total: 4, Duration: 2168ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 2] Order created - Saga: 31ae5f0b..., Items: [Stock1×1, Stock2×1, Stock3×1], Total: 3, Duration: 2178ms" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 38] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock3×2, Stock2×2, Stock4×3, Stock1×3], Total: 10 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 84] Order created - Saga: 860fdfb1..., Items: [Stock4×2], Total: 2, Duration: 2193ms" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 70] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock1×4, Stock3×3], Total: 7 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 77] Order created - Saga: d491e952..., Items: [Stock3×1, Stock4×1, Stock2×1], Total: 3, Duration: 2251ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 14] Order created - Saga: f5b0ddda..., Items: [Stock2×1], Total: 1, Duration: 2256ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 53] Order created - Saga: b4b5751a..., Items: [Stock3×2], Total: 2, Duration: 2254ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 69] Order created - Saga: 14193a13..., Items: [Stock4×1, Stock1×1, Stock2×2], Total: 4, Duration: 2258ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 68] Order created - Saga: aba991ec..., Items: [Stock3×1], Total: 1, Duration: 2258ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 18] Order created - Saga: 8f60f02d..., Items: [Stock4×1, Stock3×2, Stock2×1], Total: 4, Duration: 2256ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 13] Order created - Saga: 73d668d5..., Items: [Stock4×1, Stock1×2], Total: 3, Duration: 2272ms" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 51] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock4×2, Stock3×2, Stock2×4, Stock1×2], Total: 10 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 58] Order created - Saga: 0fc32624..., Items: [Stock1×1, Stock3×1, Stock4×2], Total: 4, Duration: 2276ms" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 64] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 89] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock4×2, Stock2×3, Stock3×2], Total: 7 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock3×3, Stock2×3], Total: 6 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 96] Order created - Saga: 90da2e0f..., Items: [Stock4×1, Stock1×2], Total: 3, Duration: 2293ms" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 52] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock2×4, Stock1×2], Total: 6 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 92] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock4×2, Stock3×2, Stock2×3], Total: 7 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 85] Order created - Saga: 599e5b8d..., Items: [Stock3×1], Total: 1, Duration: 2343ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 5] Order created - Saga: 81172a78..., Items: [Stock1×1, Stock4×2, Stock3×2], Total: 5, Duration: 2344ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 17] Order created - Saga: 3ed34d05..., Items: [Stock3×1, Stock4×1, Stock1×1], Total: 3, Duration: 2347ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 24] Order created - Saga: a6ee550c..., Items: [Stock2×2, Stock4×1], Total: 3, Duration: 2344ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 23] Order created - Saga: 7c628ed8..., Items: [Stock2×1, Stock1×2], Total: 3, Duration: 2359ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 29] Order created - Saga: d8dc9378..., Items: [Stock4×1, Stock2×1, Stock3×2], Total: 4, Duration: 2360ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 91] Order created - Saga: 47a96a14..., Items: [Stock4×2], Total: 2, Duration: 2358ms" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 67] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock2×4, Stock4×4, Stock3×2], Total: 10 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 86] Order created - Saga: ef534a91..., Items: [Stock2×1, Stock4×1], Total: 2, Duration: 2384ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 20] Order created - Saga: 34129067..., Items: [Stock2×2, Stock3×2, Stock4×1], Total: 5, Duration: 2413ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 11] Order created - Saga: a7907ac7..., Items: [Stock3×2, Stock4×1, Stock2×2], Total: 5, Duration: 2423ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 80] Order created - Saga: f62d9680..., Items: [Stock4×1], Total: 1, Duration: 2436ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 6] Order created - Saga: 1602fe72..., Items: [Stock4×2, Stock2×1, Stock3×2], Total: 5, Duration: 2434ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 8] Order created - Saga: 5dde4a00..., Items: [Stock4×2, Stock1×3], Total: 5, Duration: 2432ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 1] Order created - Saga: 35149494..., Items: [Stock4×1, Stock2×2], Total: 3, Duration: 2434ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 10] Order created - Saga: d8ed4379..., Items: [Stock2×2, Stock4×2], Total: 4, Duration: 2437ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 83] Order created - Saga: 66b3ebbd..., Items: [Stock2×2], Total: 2, Duration: 2436ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 48] Order created - Saga: f0b3642b..., Items: [Stock3×2, Stock4×1, Stock2×1], Total: 4, Duration: 2465ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 72] Order created - Saga: 842614dd..., Items: [Stock3×1], Total: 1, Duration: 2463ms" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 36] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock1×4, Stock3×4, Stock4×2, Stock2×4], Total: 14 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 4] Order created - Saga: 311b998d..., Items: [Stock1×2, Stock3×2], Total: 4, Duration: 2498ms" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 88] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="🎯 [User 47] Purchase limit exceeded (Expected)" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock2×2, Stock4×2, Stock1×4], Total: 8 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    ErrorCode: PURCHASE_LIMIT_EXCEEDED" source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Message: 구매 제한을 초과했습니다. 1인당 최대 구매 가능 수량을 확인해주세요." source=console
time="2026-01-11T21:04:33+09:00" level=error msg="    Attempted: [Stock2×2, Stock3×4, Stock4×3], Total: 9 > Limit: 5" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 73] Order created - Saga: 3238ce71..., Items: [Stock1×1], Total: 1, Duration: 2511ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 41] Order created - Saga: 0ff656b6..., Items: [Stock4×2, Stock2×1, Stock1×2], Total: 5, Duration: 2513ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 28] Order created - Saga: 006fe201..., Items: [Stock1×1, Stock2×1, Stock3×2], Total: 4, Duration: 2529ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 26] Order created - Saga: d1ea9f56..., Items: [Stock2×2, Stock3×1, Stock1×2], Total: 5, Duration: 2526ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 87] Order created - Saga: 40ded5cd..., Items: [Stock2×1, Stock3×1], Total: 2, Duration: 2530ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 60] Order created - Saga: 3d1e03db..., Items: [Stock3×2, Stock2×2, Stock1×1], Total: 5, Duration: 2531ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 16] Order created - Saga: f5bd2629..., Items: [Stock4×2, Stock3×1], Total: 3, Duration: 2559ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 39] Order created - Saga: 570ed172..., Items: [Stock1×2, Stock3×2, Stock2×1], Total: 5, Duration: 2577ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 54] Order created - Saga: f3825444..., Items: [Stock4×2, Stock3×1], Total: 3, Duration: 2578ms" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="✅ [User 37] Order created - Saga: c2a97d72..., Items: [Stock1×1, Stock3×2, Stock4×1], Total: 4, Duration: 2577ms" source=console
time="2026-01-11T21:04:33+09:00" level=info source=console
time="2026-01-11T21:04:33+09:00" level=info msg="🏁 Load Test Completed!" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="========================" source=console
time="2026-01-11T21:04:33+09:00" level=info source=console
time="2026-01-11T21:04:33+09:00" level=info msg="📊 Summary (check CUSTOM metrics above for accurate counts):" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="  - pending_orders_created: Successful orders" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="  - total_order_quantity: Total items ordered" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="  - purchase_limit_errors: Purchase limit exceeded (expected ~30%)" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="  - stock_errors: Stock depletion errors" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="  - point_errors: Insufficient points errors" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="  - queue_errors: Invalid queue token errors" source=console
time="2026-01-11T21:04:33+09:00" level=info msg="  - saga_failures: Other unexpected failures" source=console
time="2026-01-11T21:04:33+09:00" level=info source=console
time="2026-01-11T21:04:33+09:00" level=info msg="💡 Tip: All error counts are in CUSTOM RESULTS section" source=console
time="2026-01-11T21:04:33+09:00" level=info source=console


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<5000' p(95)=2.51s
    ✓ 'p(99)<10000' p(99)=2.52s

    http_req_failed
    ✓ 'rate<0.5' rate=26.73%

    order_duration_ms
    ✓ 'p(95)<8000' p(95)=2530.05

    order_success_rate
    ✓ 'rate>0.5' rate=73.00%


  █ TOTAL RESULTS 

    checks_total.......: 200    77.122545/s
    checks_succeeded...: 73.00% 146 out of 200
    checks_failed......: 27.00% 54 out of 200

    ✗ order: status 200 or 201
      ↳  73% — ✓ 73 / ✗ 27
    ✗ order: has sagaId
      ↳  73% — ✓ 73 / ✗ 27

    CUSTOM
    order_duration_ms..............: avg=2122.42 min=1237   med=2181.5 max=2578  p(90)=2499.3 p(95)=2530.05
    order_failure_rate.............: 27.00% 27 out of 100
    order_success_rate.............: 73.00% 73 out of 100
    pending_orders_created.........: 73     28.149729/s
    purchase_limit_errors..........: 27     10.411544/s
    total_order_quantity...........: 219    84.449186/s

    HTTP
    http_req_duration..............: avg=2.06s   min=8.61ms med=2.14s  max=2.54s p(90)=2.46s  p(95)=2.51s  
      { expected_response:true }...: avg=2.09s   min=8.61ms med=2.17s  max=2.54s p(90)=2.48s  p(95)=2.52s  
    http_req_failed................: 26.73% 27 out of 101
    http_reqs......................: 101    38.946885/s

    EXECUTION
    iteration_duration.............: avg=2.12s   min=1.23s  med=2.18s  max=2.57s p(90)=2.5s   p(95)=2.53s  
    iterations.....................: 100    38.561272/s
    vus............................: 69     min=69        max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 46 kB  18 kB/s
    data_sent......................: 79 kB  30 kB/s



running (0m02.6s), 000/100 VUs, 100 complete and 0 interrupted iterations
order_rush ✓ [ 100% ] 100 VUs  0m02.6s/2m0s  100/100 iters, 1 per VU